a=1
while a<50:
    a=a+1
    print(a)
# a=1 এখানে a টা হলো ভেরিয়েবল,আপনি ভেরিয়েবল নামের নিয়ামাবলি মেনে যে কোন নাম দিতে পারেন আপনার ইচ্ছা অনুযায়ী এখানে বলে দেয়া হয়েছে যে counter variable গণনার শুরু হবে 1 থেকে।
#while loop টা হলো কন্ডিশন ,এর মানে হলো যখন বা যতক্ষন পর্যন্ত না,এই কন্ডিশনে বলা হয়েছে যতক্ষন না a এর মান 50 না হয় ততক্ষন পর্যন্ত print করে যাও।
# a=a+1 এখানে নতুন a মান হবে,পুরাতন a সাথে 1 যোগ করে যা হয়,এভাবে যোগ করতে করতে যখন 50 হবে তখন উক্ত প্রক্রিয়া শেষ হবে।
#এবার যাকে print করা হবে তাকে print function দিলেই প্রোগ্রাম শেষ হবে যাবে।
